# RadialDimensionChangeRadiusFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..RadialDimensionChangeRadiusFailed Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Can't change radius.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RadialDimensionChangeRadiusFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RadialDimensionChangeRadiusFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RadialDimensionChangeRadiusFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace